EDT/УТ/src/Documents/мгРасчетФОТ/мгРасчетФОТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мгРасчетФОТ</name>
  <registerRecords>AccumulationRegister.мгЗарплатаУдержания</registerRecords>
  <registerRecords>AccumulationRegister.мгЗарплатаНачисления</registerRecords>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоЗаОсновнуюРаботу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоЗаПодъемы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоОтпускныхБольничных</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоНадбавки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодработкаНаСкладе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МагистральСПБ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НочнойВодитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Премия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоНачислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДисциплинарныеВзыскания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МатериальныйУщерб</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрафыПДД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пропуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоУдержано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыданАвансИЗП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВСчётЗП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительныйЛист</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоВыдано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КВыдаче</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УказанияДляБухгалтерии</name>
      <type>
        <types>CatalogRef.мгУказанияДляБухгалтерии</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыполнениеМенее85</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоПоФиксТарифу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/мгЗарплатаНачисления/мгЗарплатаНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>мгЗарплатаНачисления</name>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНачисления</name>
    <type>
      <types>CatalogRef.мгНачисленияУдержания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/AccumulationRegisters/мгЗарплатаУдержания/мгЗарплатаУдержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>мгЗарплатаУдержания</name>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУдержания</name>
    <type>
      <types>CatalogRef.мгНачисленияУдержания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Catalogs/мгНачисленияУдержания/мгНачисленияУдержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мгНачисленияУдержания</name>
  <predefined>
    <items>
      <name>ВСчетЗП</name>
      <description>В счет ЗП</description>
    </items>
    <items>
      <name>ВыданАвансИЗП</name>
      <description>Выдан аванс и ЗП</description>
    </items>
    <items>
      <name>Депримирование</name>
      <description>Депримирование</description>
    </items>
    <items>
      <name>ДисциплинарныеВзыскания</name>
      <description>Дисциплинарные взыскания</description>
    </items>
    <items>
      <name>ИсполнительныйЛист</name>
      <description>Исполнительный лист</description>
    </items>
    <items>
      <name>МагистральСПБ</name>
      <description>Магистраль СПБ</description>
    </items>
    <items>
      <name>МатериальныйУщерб</name>
      <description>Материальный ущерб</description>
    </items>
    <items>
      <name>НадбавкиПоЗаказам</name>
      <description>Надбавки по заказам</description>
    </items>
    <items>
      <name>НачислениеЗаПодъем</name>
      <description>Начисление за подъем</description>
    </items>
    <items>
      <name>НачислениеОсновное</name>
      <description>Начисление основное</description>
    </items>
    <items>
      <name>НочнойВодитель</name>
      <description>Ночной водитель</description>
    </items>
    <items>
      <name>ОтпускныеБольничные</name>
      <description>Отпускные больничные</description>
    </items>
    <items>
      <name>ПодработкаНаСкладе</name>
      <description>Подработка на складе</description>
    </items>
    <items>
      <name>Премия</name>
      <description>Премия</description>
    </items>
    <items>
      <name>Пропуска</name>
      <description>Пропуска</description>
    </items>
    <items>
      <name>ТарифПоКонтрагенту</name>
      <description>Тариф по контрагенту</description>
    </items>
    <items>
      <name>ШтрафыПДД</name>
      <description>Штрафы ПДД</description>
    </items>
  </predefined>
  <attributes>
    <name>НачислениеУдержание</name>
    <type>
      <types>EnumRef.мгНачислениеУдержание</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Documents/мгРасчетФОТ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр мгЗарплатаНачисления Расход
	Движения.мгЗарплатаНачисления.Записывать = Истина;
	Движения.мгЗарплатаНачисления.Очистить();
	
	Движения.мгЗарплатаУдержания.Записывать = Истина;
	Движения.мгЗарплатаУдержания.Очистить();
	
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		//начисления
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.НачисленоЗаОсновнуюРаботу) Тогда
			Движение = Движения.мгЗарплатаНачисления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.НачислениеОсновное");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.НачисленоЗаОсновнуюРаботу;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.НачисленоПоФиксТарифу) Тогда
			Движение = Движения.мгЗарплатаНачисления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ТарифПоКонтрагенту");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.НачисленоПоФиксТарифу;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.НачисленоЗаПодъемы) Тогда
			Движение = Движения.мгЗарплатаНачисления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.НачислениеЗаПодъем");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.НачисленоЗаПодъемы;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.НачисленоНадбавки) Тогда
			Движение = Движения.мгЗарплатаНачисления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.НадбавкиПоЗаказам");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.НачисленоНадбавки;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.ПодработкаНаСкладе) Тогда
			Движение = Движения.мгЗарплатаНачисления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ПодработкаНаСкладе");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.ПодработкаНаСкладе;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.МагистральСПБ) Тогда
			Движение = Движения.мгЗарплатаНачисления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.МагистральСПБ");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.МагистральСПБ;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.НочнойВодитель) Тогда
			Движение = Движения.мгЗарплатаНачисления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.НочнойВодитель");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.НочнойВодитель;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.Премия) Тогда
			Движение = Движения.мгЗарплатаНачисления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.Премия");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.Премия;
		КонецЕсли;
		// удержания
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.НачисленоОтпускныхБольничных) Тогда
			Движение = Движения.мгЗарплатаУдержания.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ОтпускныеБольничные");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.НачисленоОтпускныхБольничных;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.ВыполнениеМенее85) Тогда
			Движение = Движения.мгЗарплатаУдержания.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.Депримирование");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.ВыполнениеМенее85;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.ДисциплинарныеВзыскания) Тогда
			Движение = Движения.мгЗарплатаУдержания.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ДисциплинарныеВзыскания");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.ДисциплинарныеВзыскания;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.МатериальныйУщерб) Тогда
			Движение = Движения.мгЗарплатаУдержания.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.МатериальныйУщерб");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.МатериальныйУщерб;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.ШтрафыПДД) Тогда
			Движение = Движения.мгЗарплатаУдержания.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ШтрафыПДД");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.ШтрафыПДД;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.Пропуска) Тогда
			Движение = Движения.мгЗарплатаУдержания.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.Пропуска");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.Пропуска;
		КонецЕсли;
		
		//выплаты
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.ВыданАвансИЗП) Тогда
			Движение = Движения.мгЗарплатаУдержания.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ВыданАвансИЗП");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.ВыданАвансИЗП;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.ВСчётЗП) Тогда
			Движение = Движения.мгЗарплатаУдержания.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ВСчетЗП");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.ВСчётЗП;
		КонецЕсли;
		Если ТекСтрокаСотрудники.КВыдаче < 0 Тогда
			Движение = Движения.мгЗарплатаУдержания.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ВСчетЗП");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.КВыдаче;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокаСотрудники.ИсполнительныйЛист) Тогда
			Движение = Движения.мгЗарплатаУдержания.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.Организация = ТекСтрокаСотрудники.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ИсполнительныйЛист");
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.Тариф = ТекСтрокаСотрудники.ИсполнительныйЛист;
		КонецЕсли;
		
	КонецЦикла;

	
	// регистр мгЗарплатаУдержания Расход
	//Движения.мгЗарплатаУдержания.Записывать = Истина;
	//Движения.мгЗарплатаУдержания.Очистить();
	//Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
	//	Движение = Движения.мгЗарплатаУдержания.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	Движение.Период = КонецМесяца(ПериодРегистрации);
	//	Движение.Организация = Организация;
	//	Движение.Терминал = Терминал;
	//	Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
	//КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
